{
  "poems": [
    {
      "date": "2026-02-01",
      "theme": "building something lasting",
      "hash": "d3a8a56761b3a1548078f0a763c9714fa34c1f70cff5035b64bbb1bdc246f714",
      "text": "A single granite slab rests on the workshop floor—  \nrough edges softened by hands that dream beyond the stone.  \nEach chip, a whisper of patience; each polish, a promise  \nto craft not merely surfaces but stories.  \n\nFrom distant waters, a boy once crossed,  \nhis pockets light, his vision vast,  \nseeds of hope in the soil of foreign lands,  \nwhere opportunity waits in the spaces between struggle and chance.  \n\nThe pivot comes suddenly—  \nnot in the triumphs sung aloud,  \nbut in the quiet hours of doubt,  \nwhen courage is the last grain lodged beneath the nail,  \nand fear stretches long shadows toward the dawn.  \n\nHere, in this moment, the future is forged—  \nnot in gold or fleeting acclaim, but in trust,  \nbuilt frame by frame with steady hands and steadfast hearts.  \n\nA legacy is not a monument on a hill;  \nit is the tree that grows beyond the planter’s eyes,  \nrooted deep in unseen ground,  \nstretching into a canopy where others find shade.  \n\nAnd so the work continues—  \nnot to conquer, but to nurture,  \nnot to stand alone, but to reach outward,  \nfor lasting craft is love made tangible.  \n\nIn the quiet gleam of polished stone,  \nI see the story still unfolding:  \nsuccess is the journey home."
    },
    {
      "date": "2026-02-01",
      "theme": "building something lasting",
      "hash": "70a16b11397697df3e8160f7a3bc2bf6a400e0b79a946006f943db8d12c566b8",
      "text": "A slab of granite, cool beneath calloused palms,  \ncut from earth’s slow patience,  \nits veined surface a map of enduring time.  \nManu saw beyond this weight, this stone—  \na foundation not for walls but for futures,  \neach block a seedling in the wilderness of want.  \n\nThe journey was not linear—  \na pivot at the crossroads where doubt lurked,  \nfear’s shadow brushing against hope’s flame.  \nIn that moment, resolve did not falter;  \nit crystallized like quartz, sharp and clear—  \na steadfast promise to build not just business,  \nbut bridges of trust and opportunity for those unseen.  \n\nHands worn by labor, eyes bright with dreams,  \nhe learned that legacy is more than monument—  \nit is the quiet work of lifting others,  \nthe invisible mortar binding lives.  \n\nFrom India’s soil to the shores of tomorrow,  \nwhere every milestone is a step forward,  \nand every challenge a teacher’s gift,  \nhe planted not only roots but wings.  \n\nBecause to build something lasting is to give away  \nthe very stones you hold,  \nso others may craft their own horizon."
    }
  ]
}